Revit 2024 API
BalusterPattern.Length Property
 The length of the main baluster pattern.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public double Length { get; }
Visual Basic
Public ReadOnly Property Length As Double
	Get
Visual C++
public:
property double Length {
	double get ();
}
See Also
BalusterPattern Class
Autodesk.Revit.DB.Architecture Namespace